Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateOpenMiddleStringers Property
 Can't cut open/middle stringers geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateOpenMiddleStringers { get; }
Public Shared ReadOnly Property CannotCreateOpenMiddleStringers As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateOpenMiddleStringers {
	FailureDefinitionId^ get ();
}
static member CannotCreateOpenMiddleStringers : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace